Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ОписаниеДопустимыхТиповПеретаскивания; // Типы, которые можно перетаскивать в курс


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Содержание;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Ссылки;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	//////////////////////////////////////////////////////////////////	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
	//----------------------------------//
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	РазработкаСУЗКлиент.ОбработкаВыбораНовогоЭлементаСУЗ(ВыбранноеЗначение, ИсточникВыбора, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЭлектронныйРесурсОбновлен" И Параметр = Объект.Ссылка Тогда
		
		Если НЕ Модифицированность Тогда
			Прочитать();
		КонецЕсли;
		
		Элементы.Содержание.Обновить();
		Элементы.СкрытыеРесурсы.Обновить();
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	РазработкаСУЗКлиент.ОбработкаЗаписиНовогоЭлементаСУЗ(НовыйОбъект, Источник, ЭтотОбъект, СтандартнаяОбработка);
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
		Тест = Справочники.СводыЗнанийСУЗ.Тест(Объект.Ссылка);
	КонецЕсли;
	
	ОпределитьТипыСкрытыхРесурсов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", Параметры.КонтекстРедактирования);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.УдалитьЭлементПослеЗаписи(ЭлементыДляУдаления);
	
	ОпределитьТипыСкрытыхРесурсов();
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("ЭлектронныйРесурсЗаписан", Объект.Ссылка, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПоказыватьПоследнююВерсиюПриИзменении(Элемент)
	Элементы.ПредпочитатьПоставщика.Доступность = Объект.ПоказыватьПоследнююВерсию;
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСодержаниеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСодержание

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Содержание

&НаКлиенте
Процедура СодержаниеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияСУКлиент.ПередВыборомЭлементаПодчиненногоСправочника(ЭтотОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		РедактироватьЭлементСодержания();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВыделеннаяГруппа = ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.Содержание);
		
		ДобавитьЭлементВСодержаниеКурса(ВыбранноеЗначение, ВыделеннаяГруппа, Объект.Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СодержаниеОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) <> Тип("СправочникСсылка.СодержаниеСУЗ")
		И ЗначениеЗаполнено(НовыйОбъект) Тогда
		
		СтандартнаяОбработка = Ложь;
		ДобавитьЭлементВСодержаниеКурса(НовыйОбъект, ВыделеннаяГруппаСодержания(), Объект.Ссылка);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПеретаскивание(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка, Строка, Объект.Ссылка, Элементы.Содержание, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	РазработкаСУЗКлиент.ОбработатьСобытиеПроверкаПеретаскивания(ПараметрыПеретаскивания, ОписаниеДопустимыхТиповПеретаскивания, СтандартнаяОбработка); 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Создание новых элементов

&НаКлиенте
Процедура СоздатьЭлементСодержания(ИмяЭлемента)
	
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.Содержание, ИмяЭлемента, Объект.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТеорию(Команда)
	СоздатьЭлементСодержания("Теория");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТест(Команда)
	СоздатьЭлементСодержания("Тест");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГлоссарий(Команда)
	СоздатьЭлементСодержания("Глоссарий");	
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеСоздатьФайл(Команда)
	СоздатьЭлементСодержания("Файл");
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеПереместитьВСкрытые(Команда)
	
	ТекущиеДанные = Элементы.Содержание.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Группа элементов содержания не может быть перемещена в скрытые'"));
		Возврат;	
	КонецЕсли;
	
	НоваяСтрока = Объект.СкрытыеРесурсы.Добавить();
	НоваяСтрока.Ресурс = ТекущиеДанные.СсылкаНаЭлемент;
	
	ПометитьЭлементСодержанияНаУдаление(ТекущиеДанные.Ссылка);	
	
	
КонецПроцедуры

// Содержание

&НаКлиенте
Процедура РедактироватьЭлементСодержания()
	
	РазработкаСУЗКлиент.РедактироватьЭлементТаблицыСУЗ(Элементы.Содержание, "СсылкаНаЭлемент", Объект.Ссылка); 	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЭлемент(Команда)
	РедактироватьЭлементСодержания();
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вверх", Элементы.Содержание);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вниз", Элементы.Содержание);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьЭлементСодержания(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Содержание.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(Объект.Ссылка,,, ТекущиеДанные.Ссылка);
	
КонецПроцедуры

// Загрузка

&НаКлиенте
Процедура ЗагрузитьФайлы(ТипКонтента="") Экспорт
	РазработкаСУЗКлиент.ЗагрузитьЭлементыВТаблицуСУЗ(ЭтотОбъект, Элементы.Содержание, Объект.Ссылка,,,,ТипКонтента);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТеорию(Команда)
	ЗагрузитьФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТест(Команда)
	ЗагрузитьФайлы("тест");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГлоссарий(Команда)
	ЗагрузитьФайлы("глоссарий");
КонецПроцедуры

// Добавление ранее созданных элементов

&НаКлиенте
Процедура ДобавитьРанееСозданныйЭлемент(ИмяТаблицы, ПараметрыФормы=Неопределено)
	
	РазработкаСУЗКлиент.ДобавитьЭлементВТаблицуСУЗ(ЭтотОбъект, Элементы.Содержание, ИмяТаблицы, Параметрыформы);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТеорию(Команда)
	
	ДобавитьРанееСозданныйЭлемент("ПодборкиСУЗ", Новый Структура("Отбор", Новый Структура("ЭтоТест", Ложь)));

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТест(Команда)
	
	ДобавитьРанееСозданныйЭлемент("ПодборкиСУЗ", Новый Структура("Отбор", Новый Структура("ЭтоТест", Истина)));

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГлоссарий(Команда)
	
	ДобавитьРанееСозданныйЭлемент("ГлоссарииСУЗ");

КонецПроцедуры

&НаКлиенте
Процедура СодержаниеДобавитьФайл(Команда)
	ДобавитьРанееСозданныйЭлемент("РесурсыСУЗ");
КонецПроцедуры

// Стартовая страница

&НаКлиенте
Процедура СтартоваяСтраницаСоздать(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница", "СтраницыСУЗ", НСтр("ru = 'Стартовая страница'"), Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СтартоваяСтраницаДобавитьИзРанееСозданных(Команда)
	РазработкаСУЗКлиент.ДобавитьИзРанееСозданныхРеквизитСУЗ(ЭтотОбъект, "СтартоваяСтраница", "СтраницыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура СтартоваяСтраницаРедактировать(Команда)
	РазработкаСУЗКлиент.РедактироватьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница");
КонецПроцедуры

&НаКлиенте
Процедура СтартоваяСтраницаУдалить(Команда)
	РазработкаСУЗКлиент.УдалитьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница");
КонецПроцедуры

&НаКлиенте
Процедура СтартоваяСтраницаНайтиВСписке(Команда)
	РазработкаСУЗКлиент.НайтиВСпискеЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница");
КонецПроцедуры

&НаКлиенте
Процедура СтартоваяСтраницаОчистить(Команда)
	РазработкаСУЗКлиент.ОчиститьЭлементРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница");
КонецПроцедуры

// Справочная информация

&НаКлиенте
Процедура СправочнаяИнформацияДобавитьИзРанееСозданных(Команда)
	РазработкаСУЗКлиент.ДобавитьИзРанееСозданныхРеквизитСУЗ(ЭтотОбъект, "СправочнаяИнформация", "СтраницыСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформацияНайтиВСписке(Команда)
	РазработкаСУЗКлиент.НайтиВСпискеЭлементРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация");
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформацияОчистить(Команда)
	РазработкаСУЗКлиент.ОчиститьЭлементРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация");
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформацияРедактировать(Команда)
	РазработкаСУЗКлиент.РедактироватьЭлементРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация");
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформацияСоздать(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация", "СтраницыСУЗ", НСтр("ru = 'Справочная информация'"), Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СправочнаяИнформацияУдалить(Команда)
	РазработкаСУЗКлиент.УдалитьЭлементРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация");
КонецПроцедуры


// Глоссарий

&НаКлиенте
Процедура ГлоссарийДобавитьИзРанееСозданных(Команда)
	РазработкаСУЗКлиент.ДобавитьИзРанееСозданныхРеквизитСУЗ(ЭтотОбъект, "Глоссарий", "ГлоссарииСУЗ");
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарийНайтиВСписке(Команда)
	РазработкаСУЗКлиент.НайтиВСпискеЭлементРеквизитаСУЗ(ЭтотОбъект, "Глоссарий");
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарийРедактировать(Команда)
	РазработкаСУЗКлиент.РедактироватьЭлементРеквизитаСУЗ(ЭтотОбъект, "Глоссарий");
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарийСоздать(Команда)
	РазработкаСУЗКлиент.СоздатьЭлементРеквизитаСУЗ(ЭтотОбъект, "Глоссарий", "ГлоссарииСУЗ", Объект.Наименование, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарийУдалить(Команда)
	РазработкаСУЗКлиент.УдалитьЭлементРеквизитаСУЗ(ЭтотОбъект, "Глоссарий");
КонецПроцедуры

&НаКлиенте
Процедура ГлоссарийОчистить(Команда)
	РазработкаСУЗКлиент.ОчиститьЭлементРеквизитаСУЗ(ЭтотОбъект, "Глоссарий");
КонецПроцедуры

// Скрытые ресурсы

&НаКлиенте
Процедура СкрытыеРесурсыРедактировать(Команда)
	
	ОткрытьСкрытыйРесурс();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыСоздатьФайл(Команда)
	
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.СкрытыеРесурсы, "Файл", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыСоздатьСтраницу(Команда)
	
	РазработкаСУЗКлиент.СоздатьЭлементТаблицыСУЗ(ЭтотОбъект, Элементы.СкрытыеРесурсы, "Страница", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыЗагрузить(Команда)
	
	РазработкаСУЗКлиент.ЗагрузитьЭлементыВТаблицуСУЗ(ЭтотОбъект, Элементы.СкрытыеРесурсы, Объект.Ссылка,,,,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыПросмотреть(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СкрытыеРесурсы.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыСУЗКлиент.ОткрытьОбозреватель(,ТекущиеДанные.РесурсДляПросмотра);	
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыРедактироватьОригинал(Команда)
	
	ТекущиеДанные = Элементы.СкрытыеРесурсы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(,ТекущиеДанные.Ресурс);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСсылки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Ссылки

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСкрытыеРесурсы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СкрытыеРесурсы

&НаКлиенте
Процедура СкрытыеРесурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СкрытыеРесурсыРесурсДляРедактирования" 
		ИЛИ Поле.Имя = "СкрытыеРесурсыНомерСтроки"
		ИЛИ Поле.Имя = "СкрытыеРесурсыТипРесурсаДляРедактирования" Тогда
	
		ОткрытьСкрытыйРесурс();
		
	КонецЕсли;
	
	Если Поле.Имя = "СкрытыеРесурсыТипОригинала" Тогда
	
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Ресурс);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РесурсДляЗаписи = НовыйОбъект;
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		РесурсДляЗаписи = Источник.Объект.Владелец; // Ресурс файла
	КонецЕсли;
	
	НоваяСтрока = Объект.СкрытыеРесурсы.Добавить();
	НоваяСтрока.Ресурс = РесурсДляЗаписи;
	НоваяСтрока.ТипОригинала = Строка(ТипЗнч(РесурсДляЗаписи));
	
	НоваяСтрока.РесурсДляРедактирования = НовыйОбъект;
	НоваяСтрока.ТипРесурсаДляРедактирования = ТипСкрытогоРесурсаДляРедактирования(НоваяСтрока.РесурсДляРедактирования);	
	
	НоваяСтрока.РесурсДляПросмотра = РесурсДляЗаписи;
	
	Элементы.СкрытыеРесурсы.ТекущаяСтрока = Объект.СкрытыеРесурсы.Индекс(НоваяСтрока);
	
	Записать(); // Необходимо, так как табличная часть может быть перечитана из базы
	            // и новая запись пропадет.
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытыеРесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы() Экспорт
	
	// Элементы
	
	Элементы.ПредпочитатьПоставщика.Доступность = Объект.ПоказыватьПоследнююВерсию;
	
	РазработкаСУЗ.УстановитьДоступностьКомандРеквизитаСУЗ(ЭтотОбъект, "СтартоваяСтраница");
	РазработкаСУЗ.УстановитьДоступностьКомандРеквизитаСУЗ(ЭтотОбъект, "Глоссарий");
	РазработкаСУЗ.УстановитьДоступностьКомандРеквизитаСУЗ(ЭтотОбъект, "СправочнаяИнформация");
	
	Если Объект.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест И ЗначениеЗаполнено(Тест) Тогда
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(ЭтотОбъект, "ФормаСправочникСводыЗнанийСУЗПолнотекстовыйПоиск", Ложь);
		
		Элементы.ГруппаСодержание.Видимость = Ложь;
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ГруппаПользовательскиеНастройки.Видимость = Ложь;
		
		Элементы.ГруппаНастройкиТеста.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаНастройкиТеста.Видимость = Ложь;
		
	КонецЕсли;
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Содержание, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Ссылки, Объект.Ссылка);
	
	// Реквизиты
	
	GUID = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	// Настройки
	
	Элементы.ПоследовательнаяНавигация.Доступность = НЕ Объект.СкрытьСодержание;
	
	Если Объект.СкрытьСодержание Тогда
		Объект.ПоследовательнаяНавигация = Истина;
	КонецЕсли;
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.Карта);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СкрытьСодержание);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.БлокироватьНепройденное);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоследовательнаяНавигация);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьТерминВсплывающейПодсказкой);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказыватьПервуюСсылкуНаТермин);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ГруппаСправочнаяИнформация);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ГруппаПользовательскиеНастройки);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ГруппаВерсииОбъектов);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.Шаблон);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СодержаниеДобавитьГлоссарий);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(Объект.Ссылка, МассивЭлементовНеподдерживаемыхПлееромВебКабинета, Объект.Ссылка.Пустая());

КонецПроцедуры

// Содержание

&НаКлиенте
Функция ВыделеннаяГруппаСодержания()
	Возврат ОбщегоНазначенияСУКлиент.ВыделеннаяГруппаТаблицы(Элементы.Содержание);
КонецФункции

&НаСервере
Процедура ДобавитьЭлементВСодержаниеКурса(СсылкаНаЭлемент, Группа, ЭлектронныйРесурс)
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		СсылкаНаЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Владелец"); // Прикрепляем ресурс, а не файл
	КонецЕсли;
	
	Справочники.СводыЗнанийСУЗ.ДобавитьЭлементСодержания(ЭлектронныйРесурс, СсылкаНаЭлемент, Группа);
	
	Элементы.Содержание.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьЭлементСодержанияНаУдаление(ЭлементСодержания)
	
	ЭлементСодержанияОбъект = ЭлементСодержания.ПолучитьОбъект();
	ЭлементСодержанияОбъект.УстановитьПометкуУдаления(Истина, Истина);
	
	Элементы.Содержание.Обновить();
	
КонецПроцедуры

// Скрытые ресурсы

&НаКлиенте
Процедура ОткрытьСкрытыйРесурс()
	
	ТекущиеДанные = Элементы.СкрытыеРесурсы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЭлектронныйРесурс", Объект.Ссылка);
	
	ОбщегоНазначенияСУКлиент.ОткрытьЗначениеВФорме(?(ЗначениеЗаполнено(ТекущиеДанные.РесурсДляРедактирования), ТекущиеДанные.РесурсДляРедактирования, ТекущиеДанные.Ресурс), ПараметрыФормы, Элементы.СкрытыеРесурсы);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьТипыСкрытыхРесурсов()
	
	// Определям типы скрытых ресурсов
	
	Для каждого Строка Из Объект.СкрытыеРесурсы Цикл
	
		Строка.РесурсДляРедактирования = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляРедактирования(Строка.Ресурс);
		Строка.ТипРесурсаДляРедактирования = ТипСкрытогоРесурсаДляРедактирования(Строка.РесурсДляРедактирования);
	    Строка.ТипОригинала = Строка(ТипЗнч(Строка.Ресурс));
		Строка.РесурсДляПросмотра = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляПросмотра(Строка.Ресурс);

	КонецЦикла;		

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипСкрытогоРесурсаДляРедактирования(РесурсДляРедактирования)
	
	Возврат Справочники.СводыЗнанийСУЗ.ТипСкрытогоРесурсаДляРедактирования(РесурсДляРедактирования);	
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПакетSCORM(Команда)
	
	Отказ = Ложь;
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеЗагрузкиПакетаSCORM", ЭтотОбъект);		
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеЗагрузкиПакетаSCORM(Результат, АдресФайла, ИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Расширение = ".zip" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ПутьКФайлуПакета",  ОбъектыСУЗ.ПолучитьПутьКПакетуДанных(АдресФайла, ИмяФайла));
		ПараметрыФормы.Вставить("ЭлектронныйРесурсДляЗамены", Объект.Ссылка);
		
		ОткрытьФорму("ПланОбмена.ОбменМатериаламиСУЗ.Форма.ФормаИмпортаПакетаSCORM", ПараметрыФормы);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите файл пакета в формате zip'"));
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОператорыОсновнойПрограммы

// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Файл"));
МассивТипов.Добавить(Тип("СправочникСсылка.СодержаниеСУЗ"));

ОписаниеДопустимыхТиповПеретаскивания = Новый ОписаниеТипов(МассивТипов);

#КонецОбласти
